CSI API ETABS v1
cPropFrame.SetTrapezoidal Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetTrapezoidal(
	string Name,
	string MatProp,
	double T3,
	double T2,
	double T2b,
	int Color = -1,
	string Notes = "",
	string GUID = ""
)
Function SetTrapezoidal (
	Name As String,
	MatProp As String,
	T3 As Double,
	T2 As Double,
	T2b As Double,
	Optional Color As Integer = -1,
	Optional Notes As String = "",
	Optional GUID As String = ""
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim MatProp As String
Dim T3 As Double
Dim T2 As Double
Dim T2b As Double
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetTrapezoidal(Name,
	MatProp, T3, T2, T2b, Color, Notes,
	GUID)
int SetTrapezoidal(
	String^ Name,
	String^ MatProp,
	double T3,
	double T2,
	double T2b,
	int Color = -1,
	String^ Notes = L"",
	String^ GUID = L""
)
abstract SetTrapezoidal :
        Name : string *
        MatProp : string *
        T3 : float *
        T2 : float *
        T2b : float *
        ?Color : int *
        ?Notes : string *
        ?GUID : string
(* Defaults:
        let _Color = defaultArg Color -1
        let _Notes = defaultArg Notes ""
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
MatProp
Type: System.String
T3
Type: System.Double
T2
Type: System.Double
T2b
Type: System.Double
Color (Optional)
Type: System.Int32
Notes (Optional)
Type: System.String
GUID (Optional)
Type: System.String
Return Value
Type: Int32
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace